import pandas as pd

# 데이터 변수 선언 -------------------------------------
TEMP_CSV = "./tem10y.csv"

# ----------------------------------------------------
# 데이터 준비
# ----------------------------------------------------
df = pd.read_csv(TEMP_CSV, encoding="utf-8")

# ----------------------------------------------------
# 데이터 계산
# ----------------------------------------------------
# 날짜별 기온 딕셔너리 생성
md = {}
for i, row in df.iterrows():
    m, d, v = (int(row['월']), int(row['일']), float(row['기온']))
    key = str(m) + "/" + str(d)
    if not(key in md): md[key] = []
    md[key] += [v]

# 날짜별 기온 평균 계산
avs = {}
print(" ---------- 날짜별 평균 기온 -------------")
for key in md:
    v = avs[key] = sum(md[key]) / len(md[key])
    print("{0} : {1}".format(key, round(v,2))) # round는 소수점 둘째자리가지 출력하는 함수

#첫해애 2/29가 없으므로 2/29는 그 이후에 읽혀서 결국 맨 마지막으로 들어간다